/* %1$@ = a localized and formatted number; %2$@ = a unit; e.g “15 kg” */
"%1$@ %2$@" = "%1$@ %2$@";

/* %1$@ = calories value; %2$@ = calories unit; e.g. “400 kcal”; appended to string like “Running Workout, 30 minutes, 5 km, 400 kcal */
", total calories %1$@ %2$@" = ", kaloreita yhteensä %1$@ %2$@";

/* %1$@ = distance value; %2$@ = unit; e.g. “5 km”; appended to string like “Running Workout, 30 minutes, 5 km */
", total distance %1$@ %2$@" = ", kokonaismatka %1$@ %2$@";

/* %1$@ = iTunes store object (e.g. album. song); %2$@ = artist name */
"%1$@ by %2$@" = "%1$@ / %2$@";

/* %1$@=Type of workout, %2$@=localized duration */
"%1$@ Workout, %2$@" = "%1$@, %2$@";

/* %2$@ = of %d photos; whole thing looks like “1 of 3\nphotos” */
"%1$d %2$@" = "%1$d %2$@";

/* %@ = date that a file was last modified */
"modified %@" = "muokattu %@";

/* %@ = service name (e.g. Email) */
"%@ Accounts" = "Tilit (%@)";

/* %@=Type of workout */
"%@ Workout, no unit data" = "%@, yksiköstä ei tietoa";

/* A folder in Dropbox or Box */
"Folder" = "Kansio";

/* A single App Store app */
"App Store app" = "App Store -appi";

/* A single Box file */
"Box file" = "Box-tiedosto";

/* A single Dropbox file */
"Dropbox file" = "Dropbox-tiedosto";

/* A single Evernote note */
"Evernote note" = "Evernote-muistiinpano";

/* A single Giphy item */
"Giphy item" = "Giphy-kohde";

/* A single Trello board */
"Trello board" = "Trello-taulu";

/* A single Trello card */
"Trello card" = "Trello-kortti";

/* A single Trello item */
"Trello item" = "Trello-kohde";

/* A single Trello list */
"Trello list" = "Trello-luettelo";

/* A single Ulysses sheet */
"Ulysses sheet" = "Ulysses-arkki";

/* A single bar code */
"Bar code" = "Viivakoodi";

/* A single blood pressure recording */
"Blood pressure" = "Verenpaine";

/* A single health sample in HealthKit */
"Health sample" = "Näyte";

/* A single iTunes artist */
"iTunes artist" = "iTunes-artisti";

/* A single iTunes product */
"iTunes product" = "iTunes-tuote";

/* Access resource error for notifications */
"Update Notification Settings" = "Päivitä ilmoitusasetukset";

/* Accessibility hint; front/rear camera switcher button */
"Switches between the front and back facing cameras" = "Vaihtaa etu- ja takakameran välillä";

/* Accessibility label for camera shutter button */
"Take picture" = "Ota kuva";

/* Accessibility label; button to start dictation */
"Start dictation" = "Aloita sanelu";

/* Accessibility label; button to stop dictation */
"Stop dictation" = "Lopeta sanelu";

/* Accessibility label; camera chooser; front facing camera is selected */
"Camera chooser - front facing" = "Kameran valitsin - etukamera";

/* Accessibility label; camera chooser; rear facing camera is selected */
"Camera chooser - rear facing" = "Kameran valitsin - takakamera";

/* Accessibility label; front/rear camera switcher button; default state */
"Camera flip" = "Kameran vaihto";

/* Add Trello card action error */
"You must provide a name to use for the new Trello Card." = "Anna uudelle Trello-kortille nimi.";

/* Add Trello card action error */
"You must select a board to create the card on." = "Sinun on valittava taulu, johon kortti luodaan.";

/* Add Trello card action error */
"You must select a list to create the card on." = "Sinun on valittava lista, johon kortti luodaan.";

/* Add Trello card action error; %@=filename */
"Uploading %@ as an attachment failed." = "Kohteen %@ lähetys liitteenä epäonnistui.";

/* Add new event or reminder error */
"The alert time provided was invalid. Please check for spelling errors and ensure you provide a time of day." = "Annettu hälytysaika oli virheellinen. Tarkista kirjoitusvirheiden varalta ja varmista, että annat vuorokaudenajan.";

/* Add new event; choose end date */
"Choose End Date" = "Valitse päättymispäivä";

/* Add new event; date range; %1$@=start date; %12$@=end date */
"%1$@ – %2$@" = "%1$@ – %2$@";

/* Add new event; error */
"An invalid end date was provided. Please provide an end date for this event." = "Annettiin virheellinen päättymispäivämäärä. Anna tapahtuman päättymispäivämäärä.";

/* Add new event; error */
"An invalid start date was provided. Please provide a start date for this event." = "Annettiin virheellinen alkamispäivämäärä. Anna tapahtuman alkamispäivämäärä.";

/* Add new event; error */
"Invalid End Date" = "Virheellinen päättymispäivä";

/* Add new event; error */
"Invalid Start Date" = "Virheellinen alkamispäivä";

/* Add new event; error */
"No title was provided. Please provide a title for this event." = "Nimeä ei annettu. Anna tapahtumalle nimi.";

/* Add new reminder error */
"No title was provided. Please provide a title for this reminder." = "Nimeä ei annettu. Anna muistutukselle nimi.";

/* Add new reminder error */
"The alert location provided could not be found." = "Annettua hälytyspaikkaa ei löytynyt.";

/* Add new reminder; %@ = location (e.g. “1 Infinite Loop”) */
"When I Enter: %2$@" = "Kun saavun: %2$@";

/* Add new reminder; %@ = location (e.g. “1 Infinite Loop”) */
"When I Leave: %2$@" = "Kun lähden: %2$@";

/* Add new reminder; alert trigger location when I’m nearby; %@ = location (e.g. “1 Infinite Loop”) */
"When I’m near: %@" = "Kun olen lähellä: %@";

/* Add new reminder; alert trigger never */
"Never" = "Ei koskaan";

/* Add new reminder; alert trigger time or location varies */
"Varies" = "Vaihtelee";

/* Add to Wunderlist action no list selected error */
"No List Selected" = "Luetteloa ei ole valittu";

/* Add to Wunderlist action no list selected error */
"You must select a list to add the task to." = "Sinun on valittava luettelo, johon tehtävä lisätään.";

/* Add to Wunderlist action no title error */
"No Title" = "Ei nimeä";

/* Add to Wunderlist action no title error */
"You must provide a title when creating a new task in Wunderlist." = "Sinun on annettava nimi, kun luot uuden Wunderlist-tehtävän.";

/* Alarm frequency; All days are selected */
"Every Day" = "Päivittäin";

/* Alternative name for Set Wi-Fi action for China SKU devices */
"Set WLAN" = "Aseta WLAN";

/* Alternative note for Set Wi-Fi action for China SKU devices */
"Sets the device’s WLAN to on or off." = "Asettaa laitteen WLANin päälle tai pois päältä.";

/* App name */
"1Password" = "1Password";

/* App name */
"Dropbox" = "Dropbox";

/* App name */
"Google" = "Google";

/* App name */
"Imgur" = "Imgur";

/* App name */
"Instapaper" = "Instapaper";

/* App name */
"Slack" = "Slack";

/* App name */
"Todoist" = "Todoist";

/* App name */
"Trello" = "Trello";

/* App name */
"WordPress" = "WordPress";

/* App name */
"Wunderlist" = "Wunderlist";

/* Append file error description */
"You must specify a filename or path in Append to File." = "Sinun on määritettävä tiedostonimi tai polku Lisää tiedostoon -toiminnossa.";

/* Append file failure reason */
"No File Path Provided" = "Tiedostopolkua ei annettu";

/* Ask for input action */
"Enter URL" = "Syötä URL";

/* Ask for input action */
"Enter number" = "Syötä numero";

/* Ask for input action */
"Pick date" = "Valitse päivämäärä";

/* Attribution for the weather service */
"The Weather Channel" = "The Weather Channel";

/* Audio recorder */
"Tap to finish recording." = "Lopeta tallennus napauttamalla.";

/* Audio recorder */
"Tap to start recording." = "Aloita äänitys napauttamalla.";

/* Base 64 encoding action error */
"The base64 data passed to Base64 Encode is invalid." = "Base64-koodaukseen annettu base64-data on virheellinen.";

/* Box error */
"A file already exists with the name “%@” at the specified path." = "Määritetyssä polussa on jo tiedosto nimeltä ”%@”.";

/* Box error */
"The folder doesn't exist" = "Kansiota ei ole olemassa";

/* Box error */
"The folder doesn’t exist" = "Kansiota ei ole olemassa";

/* Box error message */
"An error occured while authenticating your Box account." = "Box-tiliä todennettaessa tapahtui virhe.";

/* Box error; %1$@ = file path; %2$@ = service name (e.g. Box) */
"The folder you tried to save to (%1$@) is an existing file in your %2$@." = "Kansio, johon yritit tallentaa (%1$@) on olemassa oleva tiedosto (%2$@).";

/* Box error; %1$@ = file path; %2$@ = service name (e.g. Box) */
"The path you tried to append text to (%1$@) is inside of an existing file in your %2$@." = "Polku, johon yritit lisätä tekstin (%1$@) on olemassa olevan tiedoston sisällä (%2$@).";

/* Box error; %1$@ = file path; %2$@ = service name (e.g. Box) */
"The path you tried to create a folder at (%1$@) is an existing file in your %2$@." = "Polku (%1$@), johon yritit luoda kansion, on olemassa oleva tiedosto apissa %2$@.";

/* Box error; %1$@ = file path; %2$@ = service name (e.g. Box) */
"The path you tried to create a folder at (%1$@) is inside of an existing file in your %2$@." = "Polku (%1$@), johon yritit luoda kansion, on olemassa olevan tiedoston sisällä apissa %2$@.";

/* Box error; %1$@ = file path; %2$@ = service name (e.g. Box) */
"The path you tried to save to (%1$@) does not exist in your %2$@." = "Polkua, johon yritit tallentaa (%1$@), ei ole tässä palvelussa (%2$@).";

/* Box error; %@ = file path */
"We couldn’t find “%@” in your Box account." = "Tiedostopolkua %@ ei löytynyt Box-tililtäsi.";

/* Button */
"Cancel" = "Kumoa";

/* Button */
"Continue Anyway" = "Jatka silti";

/* Button */
"Delete" = "Poista";

/* Button */
"Delete Account" = "Poista tili";

/* Button */
"Done" = "Valmis";

/* Button */
"Log In" = "Kirjaudu";

/* Button */
"Next" = "Seuraava";

/* Button */
"OK" = "OK";

/* Button */
"Retry" = "Yritä uudelleen";

/* Button */
"Sign In" = "Kirjaudu";

/* Button or title */
"Add Account" = "Lisää tili";

/* Button or title */
"Login" = "Kirjaudu";

/* Button that takes user to the iOS Health app */
"Open Health" = "Avaa Terveys";

/* Button to allow access to health data or notifications */
"Allow Access" = "Salli käyttö";

/* Button to open Settings */
"Open Settings" = "Avaa Asetukset";

/* Button; edit opacity */
"Opacity" = "Peittävyys";

/* Button; edit rotatation in overlay image action */
"Rotation" = "Pyöritys";

/* Button; email account app specfic password */
"Create App-Specific Password" = "Luo appikohtainen salasana";

/* Button; reset changes made in overlay image action */
"Reset" = "Palauta";

/* Camera flash option - auto */
"Auto" = "Automaattinen";

/* Camera flash option - off */
"Off" = "Pois";

/* Camera flash option - on */
"Flash On" = "Päällä";

/* Choose an item */
"Choose" = "Valitse";

/* Choose from list action */
"Choose an item" = "Valitse kohde";

/* Choose multiple images */
"Choose Images" = "Valitse kuvat";

/* Choose one image */
"Choose Image" = "Valitse kuva";

/* CloudApp upload action error */
"This file is too large for CloudApp." = "Tämä tiedosto on liian iso CloudAppiin.";

/* CloudApp upload action error */
"You’ve exceeded the daily upload limit allowed for the CloudApp Free plan." = "Olet ylittänyt CloudApp Freen päivittäisen lähetyskiintiön.";

/* Combine images action error */
"Cannot run Combine Images" = "Yhdistä kuvat -toimintoa ei voida suorittaa";

/* Combine images action error description */
"No images were provided to combine." = "Yhdistettäviä kuvia ei annettu.";

/* Conditions of the weather */
"Weather Conditions (Plural)" = "Säätilat";

/* Conditions of the weather */
"Weather Conditions (Single)" = "Säätilat";

/* Content property name */
"Biological Sex (Content Property Name)" = "Biologinen sukupuoli";

/* Content property name */
"Blood Type (Content Property Name)" = "Veriryhmä";

/* Content property name */
"Date of Birth (Content Property Name)" = "Syntymäaika";

/* Content property name */
"Unspecified (Content Property Name)" = "Määrittämätön";

/* Create IFTTT applet */
"Create Applet" = "Luo Applet";

/* Create Trello list action error */
"You must select a board to create the list on." = "Sinun on valittava taulu, johon luettelo luodaan.";

/* Create folder failure description; no file path specified */
"You must specify a path for the new folder." = "Sinun on määritettävä polku uuteen kansioon.";

/* Create folder failure reason; no file path specified */
"No path specified!" = "Polkua ei ole määritetty!";

/* Create folder file name placeholder with preceding / */
"/Adventure/" = "/Seikkailu/";

/* Create folder file name placeholder without preceding / */
"Adventure/" = "Seikkailu/";

/* Create playlist action error */
"No name was provided. Please provide a name for the playlist." = "Nimeä ei annettu. Anna soittolistalle nimi.";

/* Date that blood pressure was recorded */
"Blood Pressure Date" = "Verenpaine mitattu";

/* Default notification text for Show Notification action. */
"Notification" = "Ilmoitus";

/* Default value for the translate text action */
"Detect Language" = "Tunnista kieli";

/* Deletion confirmation message; %@ = what is being deleted (e.g. File.txt and 5 other files); escalation level 0 */
"Are you sure you want to delete %@?" = "Poistetaanko %@?";

/* Deletion confirmation message; %@ = what is being deleted (e.g. File.txt and 5 other files); escalation level 1 */
"Are you ABSOLUTELY sure you want to delete %@?" = "Poistetaanko %@ EHDOTTOMASTI?";

/* Deletion confirmation message; %@ = what is being deleted (e.g. File.txt and 5 other files); escalation level 2 */
"Are you ABSOLUTELY POSITIVELY sure you want to delete %@?" = "Poistetaanko %@ EHDOTTOMAN VARMASTI?";

/* Deletion confirmation title; e.g. Delete File.txt and 5 other files? */
"Delete %@?" = "Poistetaanko %@?";

/* Description for unauthorized resource when trying to access a user's workout data */
"workout" = "harjoittelu";

/* Dictate text action error */
"Recognition Unavailable" = "Tunnistus ei ole saatavilla";

/* Dictate text action error */
"Speech recognition is not currently available. You may need to connect to the Internet." = "Puheentunnistus ei ole tällä hetkellä käytettävissä. Sinun on ehkä yhdistettävä internetiin.";

/* Dictate text action is listening to user */
"Now listening…" = "Kuunnellaan…";

/* Download URL action error */
"Make sure to pass a URL to the Get Contents of URL action." = "Varmista, että Hae URLin sisältö -toimintoon annetaan URL.";

/* Download URL or Open URL action error */
"No URL Specified" = "URLia ei ole määritetty";

/* Dropbox error */
"A file was expected, but the path provided refers to something that isn’t a file." = "Odotettiin tiedostoa, mutta annettu polku viittaa johonkin, joka ei ole tiedosto.";

/* Dropbox error */
"A folder was expected, but the path provided refers to something that isn’t a folder." = "Odotettiin kansiota, mutta annettu polku viittaa johonkin, joka ei ole kansio.";

/* Dropbox error */
"A shared link already exists." = "Jaettu linkki on jo olemassa.";

/* Dropbox error */
"Access to the requested path is forbidden." = "Pääsy pyydettyyn polkuun on kielletty.";

/* Dropbox error */
"An error occurred when creating a sharing link because the email associated with your Dropbox account has not been verified." = "Tapahtui virhe luotaessa jakolinkkiä, koska Dropbox-tiliisi liitettyä sähköpostiosoitetta ei ole vahvistettu.";

/* Dropbox error */
"Dropbox cannot access this file or folder because of its name." = "Dropbox ei voi käyttää tätä tiedostoa tai kansiota sen nimen vuoksi.";

/* Dropbox error */
"Dropbox cannot save this file or folder because of its name." = "Dropbox ei voi tallentaa tätä tiedostoa tai kansiota sen nimen vuoksi.";

/* Dropbox error */
"Dropbox cannot write to the specified path due to a conflict." = "Dropbox ei voi kirjoittaa määritettyyn polkuun ristiriidan vuoksi.";

/* Dropbox error */
"The file cannot be transferred because the content is restricted. For example, sometimes there are legal restrictions due to copyright claims." = "Tiedostoa ei voida siirtää, koska sen sisältö on rajoitettu. Esimerkiksi tekijänoikeudet voivat rajoittaa sisällön käyttöä.";

/* Dropbox error */
"The path root parameter provided is invalid." = "Annettu polku juuriparametriin on virheellinen.";

/* Dropbox error */
"The request timed out. Please try again." = "Pyyntö aikakatkaistiin. Yritä uudelleen.";

/* Dropbox error */
"The share settings provided are invalid." = "Annetut jakoasetukset ovat virheelliset.";

/* Dropbox error */
"We couldn’t find a file at the specified path." = "Määritetystä polusta ei löytynyt tiedostoa.";

/* Dropbox error */
"You are not allowed to modify the settings of this link." = "Et voi muuttaa tämän linkin asetuksia.";

/* Dropbox error */
"You don’t have enough available space in Dropbox to write this data." = "Tätä dataa ei voida kirjoittaa, koska sinulla ei ole riittävästi tilaa Dropboxissa.";

/* Dropbox error */
"You don’t have permission to write to the specified location." = "Sinulla ei ole oikeuksia kirjoittaa määritettyyn sijaintiin.";

/* Dropbox error; %1$@ = file path; %2$@ = service name (e.g. Dropbox) */
"The path you tried to save to (%1$@) is an existing file in your %2$@." = "Polku, johon yritit tallentaa (%1$@) on olemassa oleva tiedosto (%2$@).";

/* Dropbox error; %@=file name */
"“%@” could not be saved because it is a folder or package. Consider zipping this file using Make Archive before saving." = "Tiedostoa ”%@” ei voitu tallentaa, koska se on kansio tai paketti. Pakkaa tiedosto Arkistoi-toiminnolla ennen tallentamista.";

/* Dropbox error; %@=file path */
"No item was found at path: %@" = "Mitään kohdetta ei löytynyt polusta: %@";

/* Dropbox or Box error */
"Folder already exists" = "Kansio on jo olemassa";

/* Dropbox or Box error; %1$@ = file path; %2$@ = service name (e.g. Dropbox) */
"The path you tried to save to (%1$@) is an existing file in your %2$@. When saving multiple files at a time, you should specify a path to a folder instead." = "Polku, johon yritit tallentaa (%1$@), on olemassa oleva tiedosto (%2$@). Kun tallennat useita tiedostoja kerralla, on sen sijaan määritettävä polku kansioon.";

/* Dropbox or Box error; %1$@ = file path; %2$@ = service name (e.g. Dropbox) */
"The path you tried to save to (%1$@) is an existing folder in your %2$@. When appending or prepending text to a file, you should specify a path to a file instead." = "Polku, johon yritit tallentaa (%1$@), on olemassa oleva kansio (%2$@). Kun teksti lisätään tiedostoon, on sen sijaan määritettävä polku tiedostoon.";

/* Dropbox unknown error */
"An unknown error occurred" = "Tuntematon virhe";

/* Dropbox unknown error; %@ = error summary */
"An unknown error occurred (%@)" = "Tapahtui tuntematon virhe (%@)";

/* Email account encryption */
"Encryption" = "Salaus";

/* Email account login authentication error */
"Authentication Failed" = "Todentaminen epäonnistui";

/* Email account login authentication error description */
"The email address or password you entered was incorrect.\n\nIf you have two step verification enabled, you need to create an app-specific password." = "Syöttämäsi sähköpostiosoite tai salasana oli virheellinen.\n\nJos sinulla on kaksivaiheinen vahvistus käytössä, sinun on luotava appikohtainen salasana.";

/* Email account login authentication error description */
"The email address or password you specified was incorrect. If you have two step verification enabled, you need to enter an app-specific password instead." = "Määrittämäsi sähköpostiosoite tai salasana oli virheellinen. Jos sinulla on kaksivaiheinen vahvistus käytössä, sinun on sen sijaan syötettävä appikohtainen salasana.";

/* Email account login authentication error recovery suggestion */
"Advanced Settings" = "Lisävalinnat";

/* Email address field placeholder */
"user@example.com" = "kayttaja@example.com";

/* Email address field title or placeholder */
"Email" = "Sähköposti";

/* Email host name field placeholder */
"mail.example.com" = "mail.example.com";

/* Email host name field placeholder */
"smtp.example.com" = "smtp.example.com";

/* Email host name field title */
"Host Name" = "Palvelinnimi";

/* End date that blood pressure was recorded */
"Blood Pressure End Date" = "Verenpaineen mittauksen päättymispäivä";

/* Erorr message for Play Sound action */
"Play Sound failed because the input was in an unsupported format." = "”Toista ääni” epäonnistui, koska syötteen muotoa ei tueta.";

/* Error alert message when invalid date is entered */
"Please enter a valid date into the Date action." = "Syötä Päivämäärä-toimintoon kelvollinen päivämäärä.";

/* Error alert title when invalid date is entered or invalid date result */
"Invalid Date" = "Virheellinen päivämäärä";

/* Error description when no location is provided to Get Travel Time */
"Get Travel Time failed because no destination location was passed as input." = "Hae matka-aika -toiminto epäonnistui, koska määränpäätä ei annettu syötteenä.";

/* Error description when no web page is provided to Run JavaScript on Web Page */
"Run JavaScript on Web Page failed because no web page was passed as input." = "Suorita JavaScript verkkosivulla -toiminto epäonnistui, koska verkkosivua ei annettu syötteenä.";

/* Error message */
"Your email or password is incorrect." = "Sähköpostiosoite tai salasana on virheellinen.";

/* Error message description when an URL passed into Get Items From RSS Feed action could not be parsed */
"Please pass a valid feed URL to the Get Items from RSS Feed action." = "Anna kelvollinen syötteen URL-osoite Hae kohteet -toiminnolle RSS-syöte-toiminnosta.";

/* Error message description when no address is entered into Street Address action */
"Please enter a valid address into the Street Address action." = "Syötä Katuosoite-toimintoon kelvollinen osoite.";

/* Error message description when no valid location was passed to the Get Travel Time action */
"The location you passed to the Get Travel Time action could not be found. Try specifying a city and state in addition to the street address." = "Hae matka-aika -toimintoon antamaasi sijaintia ei löytynyt. Kokeile määrittää katuosoitteen lisäksi kaupunki ja osavaltio.";

/* Error message for toggle alarm action if there are two alarms with the same label, %@ = the alarm label */
"Multiple alarms were found with the label %@. Try choosing a specific alarm." = "Löytyi useita herätyksiä nimellä %@. Valitse tarkemmin.";

/* Error message for when the Run Home Scene action cannot find a home named %1$@. */
"Run Home Scene failed because the home “%1$@” could not be found." = "Suorita Koti-tilanne epäonnistui, koska kotia ”%1$@” ei löytynyt.";

/* Error message for when the Run Home Scene action cannot find a scene (%1$@) in the home %2$@. */
"Run Home Scene failed because the scene “%1$@” could not be found in the home “%2$@”." = "Suorita Koti-tilanne epäonnistui, koska tilannetta ”%1$@” ei löytynyt kodissa ”%2$@”.";

/* Error message for when the user does not select a home when using the Run Home Scene action. */
"Run Home Scene failed because no home was selected." = "Suorita Koti-tilanne epäonnistui, koska kotia ei ole valittu.";

/* Error message for when the user does not select a scene when using the Run Home Scene action */
"Run Home Scene failed because no scene was selected." = "Suorita Koti-tilanne epäonnistui, koska tilannetta ei ole valittu.";

/* Error message title when an URL passed into Get Items From RSS Feed action could not be parsed */
"Unable to parse news feed" = "Ei voida jäsentää uutissyötettä";

/* Error message title when no address is entered into Street Address action */
"No Address" = "Ei osoitetta";

/* Error message title when no valid location was passed to the Get Travel Time action */
"Invalid Location" = "Virheellinen sijainti";

/* Error message: Unit missing when converting */
"Please provide a unit to convert to." = "Anna muunnettava yksikkö.";

/* Error message: Unit missing when creating measurement */
"Measurement failed because no unit was specified. Please pick a unit." = "Mittayksikkö epäonnistui, koska yksikköä ei ole määritetty. Valitse yksikkö.";

/* Error message; Convert measurement between invalid units. Both parameters are names of units (i.e. kilometers per hour) */
"A measurement with unit %1$@ can not be converted to %2$@." = "Mittayksikköä %1$@ ei voida muuntaa yksikköön %2$@.";

/* Error message; Missing date when creating alarm */
"Please provide a valid date for the alarm." = "Määritä kelvollinen päivä herätykselle.";

/* Error message; Siri is disabled */
"In order to use this action, enable Siri in Settings." = "Jotta voit käyttää tätä toimintoa, ota Siri käyttöön Asetuksissa.";

/* Error message; Siri is disabled */
"Unable to complete request because Siri is disabled." = "Pyyntöä ei voida suorittaa loppuun, koska Siri ei ole käytössä.";

/* Error message; Start timer; Duration too big */
"The timer's duration must be less than 24 hours." = "Ajastimen keston pitää olla alle 24 tuntia.";

/* Error message; Start timer; Missing duration */
"Please provide a duration for the timer." = "Anna ajastimelle aika.";

/* Error message; Toggle alarm missing alarm identifier */
"Please specify an alarm to toggle." = "Määritä päälle/pois päältä laitettava herätys.";

/* Error message; Unknown error type */
"An unknown error occurred while performing the request." = "Pyyntöä suoritettaessa tapahtui tuntematon virhe.";

/* Error message; Unsupported on platform */
"Unable to complete request because it is not supported on this platform." = "Pyyntöä ei voida suorittaa loppuun, koska sitä ei tueta tässä käyttöympäristössä.";

/* Error title when no location provided to Get Travel Time */
"No Location" = "Ei sijaintia";

/* Error title when no web page is provided to the Run JavaScript on Web Page action */
"No Web Page" = "Ei verkkosivua";

/* Exit shortcut action error */
"User requested shortcut exit." = "Käyttäjä pyysi oikotien lopettamista.";

/* File name example with preceding / */
"/example.txt" = "/example.txt";

/* File name example without preceding / */
"example.txt" = "example.txt";

/* File picker; button */
"Save Here" = "Tallenna tähän";

/* File picker; get more than one selected files */
"Get Selected Files (%lu)" = "Hae valitut tiedostot (%lu)";

/* File picker; get one selected file */
"Get Selected File (1)" = "Hae valittu tiedosto (1)";

/* File status */
"This folder is empty" = "Tämä kansio on tyhjä";

/* File status loading */
"Loading…" = "Ladataan…";

/* Find health sample; no samples found */
"No Samples Found" = "Näytteitä ei löytynyt";

/* Find health samples; no samples found description */
"There are either no %@ samples logged or you need to give Shortcuts access to the samples in the Health app." = "Näytteitä (%@) ei ole kirjattu tai sinun on annettava Oikoteille Terveys-apin näytteiden käyttöoikeus.";

/* Finish dictation command */
"Finish Dictation" = "Lopeta sanelu";

/* Generic health object type when we can’t determine the object type */
"Health" = "Terveys";

/* Get File action; file name example with preceding / */
"/example.txt" = "/example.txt";

/* Get File action; file name example without preceding / */
"example.txt" = "example.txt";

/* Get IP address action error */
"The domain could not be found." = "Domainia ei löytynyt.";

/* Get IP address action error */
"The domain could not be found. (Error 2)" = "Domainia ei löytynyt. (Virhe 2)";

/* Get IP address action error */
"The response data was not a valid string." = "Vastausdata ei ollut kelvollinen merkkijono.";

/* Get Trello items error */
"You must select a board to retrieve cards from." = "Sinun on valittava taulu, josta kortit noudetaan.";

/* Get Trello items error */
"You must select a board to retrieve lists from." = "Sinun on valittava taulu, josta listat noudetaan.";

/* Get Trello items error */
"You must select a list to retrieve cards from." = "Sinun on valittava luettelo, josta kortit noudetaan.";

/* Get Trello items error */
"Your Trello account couldn’t be verified. Please sign out and try again!" = "Trello-tiliäsi ei voitu vahvistaa. Kirjaudu ulos ja yritä uudelleen!";

/* Get dictionary value or set dictionary value action; no dictionary key provided error reason */
"No Key Provided" = "Avainta ei annettu";

/* Get distance action or get travel time action; custom location is provided but not found */
"Custom Location Not Found" = "Muokattua sijaintia ei löytynyt";

/* Get distance action or get travel time action; no custom location provided error reason */
"No Custom Location" = "Ei muokattua sijaintia";

/* Get distance action; custom location is provided but not found */
"Get Distance was configured to get the travel time from a custom location, but the custom location you entered was not found." = "Hae matka -toiminto määritettiin hakemaan matka-aika muokatusta sijainnista, mutta syöttämääsi muokattua sijaintia ei löytynyt.";

/* Get distance action; no custom location provided error description */
"Get Distance was configured to get the travel time from a custom location, but none was provided." = "Hae matka -toiminto määritettiin hakemaan matka-aika muokatusta sijainnista, mutta sellaista ei annettu.";

/* Get distance action; no location passed as input error */
"Get Distance could not estimate distance because no location was passed as input." = "Hae matka -toiminto ei pystynyt arvioimaan matkaa, koska sijaintia ei annettu syötteenä.";

/* Get emoji name action error */
"Failed to find the emoji font." = "Emojifonttia ei löytynyt.";

/* Get frames from image error */
"No Image Provided" = "Kuvaa ei annettu";

/* Get frames from image error description */
"No GIF was passed as input to Get Frames from Image." = "GIFiä ei annettu syötteeksi Hae kuvan kehykset -toimintoon.";

/* Get group from matched text action error */
"No Match" = "Ei osumaa";

/* Get group from matched text action error; %1$ld=group number; %2$ld=number of groups */
"The index you specified was outside of the possible range (you asked for group %1$ld, and the match has only %2$ld)" = "Määritetty indeksi oli mahdollisen alueen ulkopuolella (pyysit ryhmää %1$ld, ja osumassa on vain %2$ld)";

/* Get group from matched text action error; %ld=group number */
"Get Group from Matched Text failed because there was no match for capture group %ld." = "Hae ryhmä vastaavasta tekstistä -toiminto epäonnistui, koska otantaryhmässä %ld ei ollut osumia.";

/* Get halfway point action error */
"No first location was provided." = "Ensimmäistä sijaintia ei annettu.";

/* Get halfway point action error */
"No second location was provided." = "Toista sijaintia ei annettu.";

/* Get halfway point action error */
"Please provide a first location." = "Anna ensimmäinen sijainti.";

/* Get halfway point action error */
"Please provide a second location." = "Anna toinen sijainti.";

/* Get item from list action error; %1$d=item range start number; %2$d=item range end number */
"The range you specified was invalid (you asked for items %1$d through %2$d)" = "Määrittämäsi alue on virheellinen (pyysit kohteita %1$d - %2$d)";

/* Get item from list action error; %1$d=item range start number; %2$d=item range end number */
"The range you specified was outside of the possible range (you asked for items %1$d through %2$d, but the first item is at index 1.)" = "Määritetty alue oli mahdollisen alueen ulkopuolella (pyysit kohteita %1$d - %2$d, mutta ensimmäinen kohde on indeksissä 1).";

/* Get item from list action error; %1$d=item range start number; %2$d=item range end number; %3$d=number of items */
"The range you specified was outside of the possible range (you asked for items %1$d through %2$d, and the list has only %3$d)" = "Määritetty alue oli mahdollisen alueen ulkopuolella (pyysit kohteita %1$d - %2$d, ja listassa on vain %3$d).";

/* Get item from list action error; %d=item number */
"You asked for item %d, but the first item is at index 1." = "Pyysit kohdetta %d, mutta ensimmäinen kohde on indeksissä 1.";

/* Get lastest photo import action error */
"Shortcuts couldn’t find any imports in your photo library." = "Oikotiet ei löytänyt tuotuja kuvia kuvakirjastostasi.";

/* Get lastest photos action error */
"Shortcuts couldn’t find the requested items in your photo library." = "Oikotiet ei löytänyt pyydettyjä kohteita kuvakirjastostasi.";

/* Get travel time error; no custom location found description */
"Get Travel Time was configured to get the travel time from a custom location, but the custom location you entered was not found." = "Hae matka-aika -toiminto määritettiin hakemaan matka-aika muokatusta sijainnista, mutta syöttämääsi muokattua sijaintia ei löytynyt.";

/* Get travel time error; no custom time provided description */
"Get Travel Time was configured to get the travel time from a custom location, but none was provided." = "Hae matka-aika -toiminto määritettiin hakemaan matka-aika muokatusta sijainnista, mutta sellaista ei annettu.";

/* Health access error; %@=health data type */
"Health access to %@ is off. You can turn on health data categories in the Health app." = "Tietotyyppi ”%@” ei ole Terveyden käytössä. Voit laittaa terveystietokategoriat päälle Terveys-apissa.";

/* Health access error; %@=health data type */
"In order to answer this question, Shortcuts needs access to your %@ data." = "Jotta Oikotiet voi vastata kysymykseen, se tarvitsee käyttöoikeuden tietoihisi (%@).";

/* Health access error; %@=health data type */
"Shortcuts does not have access to your %@ data." = "Oikoteillä ei ole lupaa käyttää tämäntyyppisiä tietoja (%@).";

/* Health action; %@=quantity sample name (e.g. Body Fat Percentage) */
"%@ Quantity Sample, no unit data" = "Näyte: %@, ei yksikkötietoa";

/* Health category date */
"Date" = "Päivämäärä";

/* Health category parameter; start of menstrual cycle; should be consistent with iOS Health app */
"Start of Cycle" = "Kierron alku";

/* Health category start date */
"Start Date" = "Alkamispäivä";

/* Health quantity type; should be consistent with iOS Health app */
"Blood Pressure" = "Verenpaine";

/* Health quantity; VO2 max test type; should be consistent with iOS Health app */
"Test Type" = "Testityyppi";

/* Health quantity; blood glucose meal time; should be consistent with iOS Health app */
"Meal Time" = "Ateria-aika";

/* Health quantity; blood pressure */
"Diastolic" = "Diastolinen";

/* Health quantity; blood pressure */
"Systolic" = "Systolinen";

/* Health quantity; insulin delivery reason; should be consistent with iOS Health app */
"Reason" = "Syy";

/* Health unit for count of generic health sample */
"count" = "määrä";

/* Health unit for count of steps (歩); probably should be same as translation for “count“ if not Japanese. */
"count of steps" = "määrä";

/* Health unit for count of swimming strokes or wheelchair pushes (回); probably should be same as translation for “count“ if not Japanese. */
"count of swimming strokes, wheelchair pushes" = "määrä";

/* Health unit for joule */
"J" = "J";

/* Health unit for millimeter */
"mm" = "mm";

/* Health unit for ounce */
"oz" = "oz";

/* HealthKit access resource error; %@=HealthKit object type */
"%@ types are not implemented" = "Tyypit %@ eivät ole käytössä";

/* HealthKit resource error */
"This device does not have the Health app." = "Tässä laitteessa ei ole Terveys-appia.";

/* HealthKit resource error */
"This shortcut requires the Health app, which this device does not have." = "Tämä oikotie vaatii Terveys-apin, jota ei ole tässä laitteessa.";

/* Item with URL; $1$@ = item name; %2$@ = URL */
"%1$@ (%2$@)" = "%1$@ (%2$@)";

/* Link to a 3rd party terms of service */
"Terms of Service" = "Käyttöehdot";

/* Link to a 3rd party terms of service */
"Terms of Use" = "Käyttöehdot";

/* Location error description */
"Make sure your device isn’t in Airplane Mode and try again; turning Wi-Fi on may help." = "Varmista, että laite ei ole Lentokonetilassa ja yritä uudelleen. Wi-Fin laittaminen päälle saattaa auttaa.";

/* Location error failure reason */
"Shortcuts was unable to find your current location." = "Oikotiet ei löytänyt nykyistä sijaintiasi.";

/* Log health sample */
"An invalid date was provided. Please provide a date for the sample or leave the date field blank to use the current date." = "Annettiin virheellinen päivämäärä. Anna näytteen päivämäärä tai jätä päivämääräkenttä tyhjäksi, jolloin käytetään nykyistä päivämäärää.";

/* Log health sample */
"Invalid Date Range" = "Virheellinen päivämääräalue";

/* Log health sample */
"No Value Selected" = "Arvoa ei ole valittu";

/* Log health sample */
"Please select a type for this Health sample." = "Valitse tämän näytteen tyyppi.";

/* Log health sample */
"Please select an end date that is after the start date." = "Valitse päättymispäivä, joka on alkamispäivän jälkeen.";

/* Log health sample; cervical mucus quality should be consistent with what is is called in the iOS Health App */
"Please select a value for this cervical mucus quality sample." = "Valitse kohdunkaulan liman arvo.";

/* Log health sample; health sample type */
"No Type Selected" = "Tyyppiä ei ole valittu";

/* Log health sample; insulin delivery reason not selected */
"No Reason Selected" = "Syytä ei ole valittu";

/* Log health sample; insulin delivery reason not selected; insulin delivery reason wording should be consistent with iOS Health app */
"Please select an insulin delivery reason." = "Valitse insuliinin annon syy.";

/* Log health sample; menstruation sample should be consistent with what is is called in the iOS Health App */
"Please select a value for this menstruation sample." = "Valitse kuukautisten arvo.";

/* Log health sample; mentrual flow sample / cycle should be consistent with what is is called in the iOS Health App */
"Please select whether or not this sample was at the start of a cycle." = "Valitse, oliko tämä näyte kierron alussa.";

/* Log health sample; missing unit (mL, km, etc.) */
"No Unit Selected" = "Yksikköä ei ole valittu";

/* Log health sample; missing unit (mL, km, etc.) */
"Please select a unit of measurement for this Health sample." = "Valitse näytteen mittayksikkö.";

/* Log health sample; ovulation test should be consistent with what is is called in the iOS Health App */
"Please select a value for this ovulation test result sample." = "Valitse ovulaatiotestin tuloksen arvo.";

/* Log health sample; sleep analysis sample should be consistent with what is is called in the iOS Health App */
"Please select a value for this sleep analysis sample." = "Valitse unianalyysin arvo.";

/* Log in view; email address placeholder */
"Email address" = "Sähköpostiosoite";

/* Log workout action */
"No Workout Type Selected" = "Harjoittelun tyyppiä ei ole valittu";

/* Log workout action */
"Please select a type of activity for this workout." = "Valitse harjoittelun tyyppi.";

/* Login error */
"Your username and/or password are incorrect." = "Käyttäjätunnus ja/tai salasana on virheellinen.";

/* Login with email address disclaimer */
"Your credentials are stored on this device only and will not be shared with our servers or any third parties." = "Tunnistetietosi on tallennettu vain tähän laitteeseen, ja niitä ei jaeta palvelimillemme tai kolmansille osapuolille.";

/* Mail error */
"A recipient is required to send message" = "Viestin lähettäminen vaatii vastaanottajan";

/* Mail error */
"A sender is required to send message" = "Viestin lähettäminen vaatii lähettäjän";

/* Mail error */
"A stable connection to the server could not be established" = "Vakaata palvelinyhteyttä ei voitu muodostaa";

/* Mail error */
"Account check failed because the account is invalid" = "Tilin tarkistus epäonnistui, koska tili on virheellinen";

/* Mail error */
"An application specific password is required" = "Vaaditaan appikohtainen salasana";

/* Mail error */
"An error occurred during an IDLE operation" = "Virhe IDLE-toiminnon aikana";

/* Mail error */
"An error occurred while (un)subscribing to the requested folder" = "Tilattaessa pyydettyä kansiota tai peruutettaessa sen tilausta tapahtui virhe";

/* Mail error */
"An error occurred while appending a message to the requested folder" = "Lisättäessä viestiä pyydettyyn kansioon tapahtui virhe";

/* Mail error */
"An error occurred while copying a message to the requested folder" = "Kopioitaessa viestiä pyydettyyn kansioon tapahtui virhe";

/* Mail error */
"An error occurred while creating the requested folder" = "Luotaessa pyydettyä kansiota tapahtui virhe";

/* Mail error */
"An error occurred while deleting a message on the POP server" = "Poistettaessa viestiä POP-palvelimelta tapahtui virhe";

/* Mail error */
"An error occurred while deleting the requested folder" = "Poistettaessa pyydettyä kansiota tapahtui virhe";

/* Mail error */
"An error occurred while expunging a message in the requested folder" = "Poistettaessa viestiä pyydetyssä kansiossa tapahtui virhe";

/* Mail error */
"An error occurred while fetching a message list on the POP server" = "Haettaessa viestiluetteloa POP-palvelimella tapahtui virhe";

/* Mail error */
"An error occurred while fetching messages in the requested folder" = "Haettaessa viestejä pyydetyssä kansiossa tapahtui virhe";

/* Mail error */
"An error occurred while performing a No-Op operation" = "Suoritettaessa tyhjäkäskytoimintoa tapahtui virhe";

/* Mail error */
"An error occurred while renaming the requested folder" = "Nimettäessä pyydettyä kansiota uudelleen tapahtui virhe";

/* Mail error */
"An error occurred while requesting the server's capabilities" = "Pyydettäessä palvelimen ominaisuuksia tapahtui virhe";

/* Mail error */
"An error occurred while requesting the server's identity" = "Pyydettäessä palvelimen identiteettiä tapahtui virhe";

/* Mail error */
"An error occurred while requesting the server's namespace" = "Pyydettäessä palvelimen nimitilaa tapahtui virhe";

/* Mail error */
"An error occurred while sending the message" = "Viestiä lähetettäessä tapahtui virhe";

/* Mail error */
"An error occurred while storing flags" = "Lippuja tallennettaessa tapahtui virhe";

/* Mail error */
"An error when requesting date" = "Virhe pyydettäessä päivämäärää";

/* Mail error */
"Attempted to send a message with an illegal attachment" = "Yritettiin lähettää viesti virheellisellä liitteellä";

/* Mail error */
"Authentication is required for this SMTP server" = "Tämä SMTP-palvelin vaatii todentautumisen";

/* Mail error */
"Bandwidth limits were exceeded while requesting data from this Gmail account" = "Kaistanleveyden raja ylittyi pyydettäessä tietoja tästä Gmail-tilistä";

/* Mail error */
"Cannot send message due to possible spam detected by server" = "Viestiä ei voida lähettää palvelimen havaitseman mahdollisen roskapostin vuoksi";

/* Mail error */
"Compression is not available" = "Pakkaustoiminto ei käytettävissä";

/* Mail error */
"Credentials with password too simple" = "Tunnistetiedot salasanan kanssa ovat liian helppoja";

/* Mail error */
"Error while running custom command" = "Virhe suoritettaessa muokattua komentoa";

/* Mail error */
"File access error" = "Tiedoston käyttövirhe";

/* Mail error */
"IMAP is not enabled for this Gmail account" = "IMAP ei ole tämän Gmail-tilin käytössä";

/* Mail error */
"MobileMe is no longer an active mail service" = "MobileMe ei ole käytettävissä oleva sähköpostipalvelu";

/* Mail error */
"No valid server found" = "Kelvollista palvelinta ei löytynyt";

/* Mail error */
"Sending messages is not allowed on this server" = "Viestien lähettäminen tällä palvelimella ei ole sallittua";

/* Mail error */
"The SMTP storage limit was hit while trying to send a large message" = "SMTP-tallennusraja ylittyi yritettäessä lähettää suurikokoista viestiä";

/* Mail error */
"The certificate for this server is invalid" = "Palvelimen varmenne on virheellinen";

/* Mail error */
"The current HotMail account cannot connect to WebMail" = "Nykyinen HotMail-tili ei saa yhteyttä WebMailiin";

/* Mail error */
"The operation succeeded" = "Toiminto onnistui";

/* Mail error */
"The requested folder does not exist. Folder selection failed" = "Pyydettyä kansiota ei ole olemassa. Kansiovalinta epäonnistui";

/* Mail error */
"The server does not support STARTTLS connections" = "Palvelin ei tue STARTTLS-yhteyksiä";

/* Mail error */
"The server does not support TLS/SSL connections" = "Palvelin ei tue TLS/SSL-yhteyksiä";

/* Mail error */
"The user needs to log in via the web browser" = "Käyttäjän on kirjauduttava sisään verkkoselaimen kautta";

/* Mail error */
"Too many simultaneous connections were made to this Gmail account" = "Tälle Gmail-tilille tehtiin liian monta yhtäaikaista yhteydenottoa";

/* Mail error */
"Unable to authenticate with the current session's credential" = "Nykyisen istunnon tunnistetiedoilla ei voida todentautua";

/* Mail error */
"Unable to parse response from server" = "Vastausta ei voida jäsentää palvelimelta";

/* Mail error */
"User is over the limit for messages allowed to be sent in a single day" = "Käyttäjä on ylittänyt yhden päivän aikana sallittujen lähetettävien viestien määrän";

/* Mail error */
"Yahoo!'s servers are currently unavailable" = "Yahoo!-palvelimet eivät ole tällä hetkellä käytettävissä";

/* Mask Image action error description, no image in the chosen variable */
"The variable “%@” did not include an image to use for masking." = "Muuttuja ”%@” ei sisältänyt kuvaa maskausta varten.";

/* Mask Image action error description, no variable chosen */
"Make sure to select a variable for the “Image Mask” option in the Mask Image action." = "Muista valita muuttuja Kuvamaski-valinnalle Maskattu kuva -toiminnossa.";

/* Mask Image action error title */
"No Mask Provided" = "Maskia ei ole annettu";

/* Message in alert to indicate that the user needs to select a storage service for the action (see `Service (WFFileStorageService)`), %@ = localized name of the action */
"Please select a service in %@." = "Valitse palvelu toiminnossa %@.";

/* Message of default error for not allowing script to run */
"This JavaScript is similar to a script that is known to be unsafe. For your security it will not run." = "Tämä JavaScript samanlainen kuin skripti, jonka tiedetään olevan epäluotettava. Laitteesi suojaamiseksi sitä ei suoriteta.";

/* Multiple App Store apps */
"App Store apps" = "App Store -apit";

/* Multiple Box files */
"Box files" = "Box-tiedostot";

/* Multiple Dropbox files */
"Dropbox files" = "Dropbox-tiedostot";

/* Multiple Evernote notes */
"Evernote notes" = "Evernote-muistiinpanot";

/* Multiple Giphy items */
"Giphy items" = "Giphy-kohteet";

/* Multiple Trello boards */
"Trello boards" = "Trello-taulut";

/* Multiple Trello cards */
"Trello cards" = "Trello-kortit";

/* Multiple Trello items */
"Trello items" = "Trello-kohteet";

/* Multiple Trello lists */
"Trello lists" = "Trello-luettelot";

/* Multiple Ulysses sheet */
"Ulysses sheets" = "Ulysses-arkit";

/* Multiple bar codes */
"Bar codes" = "Viivakoodit";

/* Multiple blood pressure recordings */
"Blood pressures" = "Verenpaineet";

/* Multiple health samples in HealthKit */
"Health samples" = "Näytteet";

/* Multiple iTunes artists */
"iTunes artists" = "iTunes-artistit";

/* Multiple iTunes products */
"iTunes products" = "iTunes-tuotteet";

/* Multiple text matches */
"Text matches" = "Tekstiosumat";

/* Multiple workout samples */
"Workout samples" = "Harjoittelunäytteet";

/* Name, Description, and Concentration (percentage) of an air pollutant */
"%@ - %@: %@" = "%@ - %@: %@";

/* Navigation bar title */
"Edit Account" = "Muokkaa tiliä";

/* Navigation bar title */
"Email Settings" = "Sähköpostiasetukset";

/* Navigation bar title */
"Log In to CloudApp" = "Kirjaudu CloudAppiin";

/* Navigation bar title */
"Log in | Tumblr" = "Kirjaudu | Tumblr";

/* Navigation bar title */
"Login to Instapaper" = "Kirjaudu Instapaperiin";

/* Navigation bar title */
"Login to Pinboard" = "Kirjaudu Pinboardiin";

/* Navigation bar title */
"Login to WordPress" = "Kirjaudu WordPressiin";

/* Navigation bar title when showing trending GIF results */
"Trending" = "Nousussa";

/* Navigation bar title; app name */
"Giphy" = "Giphy";

/* Network picker option */
"Cellular" = "Mobiili";

/* Network picker option */
"WLAN" = "WLAN";

/* Network picker option */
"Wi-Fi" = "Wi-Fi";

/* No GIFs found empty state description */
"Clear the search bar to view trending GIFs." = "Tyhjennä hakupalkki, jos haluat nähdä nousussa olevat GIFit.";

/* No GIFs found empty state title */
"No Results Found" = "Tuloksia ei löytynyt";

/* None option */
"None" = "Ei mitään";

/* One text match */
"Text match" = "Tekstiosuma";

/* One workout sample */
"Workout sample" = "Harjoittelunäyte";

/* Open URL action error */
"Make sure to pass a URL to the Open URL action." = "Varmista, että Avaa URL -toimintoon annetaan URL.";

/* Open URL action error */
"The URL could not be opened." = "URLia ei voitu avata.";

/* Open app action error */
"Open App failed because it couldn’t find an app to open." = "Avaa appi -toiminto epäonnistui, koska se ei löytänyt avattavaa appia.";

/* Open app action error */
"Open App failed because the app could not be opened." = "Avaa appi -toiminto epäonnistui, koska appia ei voitu avata.";

/* Open in action error */
"Open In… failed because it couldn’t find an app to open in." = "Avaa apissa… -toiminto epäonnistui, koska se ei löytänyt appia, jossa avata.";

/* Open in action error; %1$@=app name; %2$@=file name */
"%1$@ is not installed or could not open the file %2$@." = "Appia %1$@ ei ole asennettu tai se ei voinut avata tiedostoa %2$@.";

/* Optional field placeholder */
"Optional" = "Valinnainen";

/* Overlay image action error */
"Make sure to choose a variable in the Overlay Image action." = "Muista valita muuttuja Peittokuva-toiminnossa.";

/* Overlay image action error */
"No Overlay Image" = "Ei peittokuvaa";

/* Overlay image action error; %@=variable name */
"The variable “%@” did not include an image to overlay." = "Muuttuja ”%@” ei sisältänyt kuvaa peittoa varten.";

/* Overlay image action; shown while image is being processed */
"Processing Image…" = "Käsitellään kuvaa…";

/* Parameter Enumeration Item for action Get Directions, parameter: App */
"Citymapper" = "Citymapper";

/* Parameter Enumeration Item for action Get Directions, parameter: App */
"Google Maps" = "Google Maps";

/* Parameter Enumeration Item for action Get Directions, parameter: App */
"Maps" = "Kartat";

/* Parameter Enumeration Item for action Get Directions, parameter: App */
"Waze" = "Waze";

/* Parameter Enumeration Item for action Get Directions, parameter: App; https://transitapp.com */
"Transit (App Name)" = "Transit";

/* Parameter Enumeration Item for action Get Directions, parameter: Mode */
"Biking" = "Pyöräillen";

/* Parameter Enumeration Item for action Get Directions, parameter: Mode */
"Driving" = "Autolla";

/* Parameter Enumeration Item for action Get Directions, parameter: Mode */
"Transit" = "Julkisilla";

/* Parameter Enumeration Item for action Get Directions, parameter: Mode */
"Walking" = "Kävellen";

/* Parameter placeholder; parameter sets a filename */
"optional" = "valinnainen";

/* Parameter value */
"A+ (Parameter Value)" = "A+";

/* Parameter value */
"A- (Parameter Value)" = "A-";

/* Parameter value */
"AB+ (Parameter Value)" = "AB+";

/* Parameter value */
"AB- (Parameter Value)" = "AB-";

/* Parameter value */
"After Meal (Parameter Value)" = "Aterian jälkeen";

/* Parameter value */
"Asleep (Parameter Value)" = "Unessa";

/* Parameter value */
"Awake (Parameter Value)" = "Hereillä";

/* Parameter value */
"B+ (Parameter Value)" = "B+";

/* Parameter value */
"B- (Parameter Value)" = "B-";

/* Parameter value */
"Basal (Parameter Value)" = "Perusinsuliini";

/* Parameter value */
"Before Meal (Parameter Value)" = "Ennen ateriaa";

/* Parameter value */
"Bolus (Parameter Value)" = "Ateriainsuliini";

/* Parameter value */
"Creamy (Parameter Value)" = "Voidemainen";

/* Parameter value */
"Dry (Parameter Value)" = "Kuiva";

/* Parameter value */
"Egg White (Parameter Value)" = "Valkuaismainen";

/* Parameter value */
"Female (Parameter Value)" = "Nainen";

/* Parameter value */
"Heavy (Parameter Value)" = "Runsas";

/* Parameter value */
"Idle (Parameter Value)" = "Toimettomana";

/* Parameter value */
"In Bed (Parameter Value)" = "Sängyssä";

/* Parameter value */
"Indeterminate (Parameter Value)" = "Määrittämätön";

/* Parameter value */
"Light (Parameter Value)" = "Vaalea";

/* Parameter value */
"Male (Parameter Value)" = "Mies";

/* Parameter value */
"Max Exercise Test (Parameter Value)" = "Maks. liikuntatesti";

/* Parameter value */
"Medium (Parameter Value)" = "Normaali";

/* Parameter value */
"Negative (Parameter Value)" = "Negatiivi";

/* Parameter value */
"No (Parameter Value)" = "Ei";

/* Parameter value */
"Non-Exercise Prediction (Parameter Value)" = "Ei-liikunnallinen ennuste";

/* Parameter value */
"Not Set (Parameter Value)" = "Ei asetettu";

/* Parameter value */
"O+ (Parameter Value)" = "O+";

/* Parameter value */
"O- (Parameter Value)" = "O-";

/* Parameter value */
"Other (Parameter Value)" = "Muu";

/* Parameter value */
"Positive (Parameter Value)" = "Positiivinen";

/* Parameter value */
"Protection Unused (Parameter Value)" = "Ehkäisyä ei käytetty";

/* Parameter value */
"Protection Used (Parameter Value)" = "Ehkäisyä käytettiin";

/* Parameter value */
"Sticky (Parameter Value)" = "Tahmea";

/* Parameter value */
"Stood (Parameter Value)" = "Seisottu";

/* Parameter value */
"Sub-Max Exercise Prediction (Parameter Value)" = "Liikuntaennuste alle maksimin";

/* Parameter value */
"Unspecified (Parameter Value)" = "Määrittämätön";

/* Parameter value */
"Watery (Parameter Value)" = "Vetinen";

/* Parameter value */
"Yes (Parameter Value)" = "Kyllä";

/* Parameter value; Used in the Convert Image action; this setting means the Convert Image action will match the image format of the original inputted photo */
"Match Input" = "Täsmää syöte";

/* Password placeholder or title */
"Password" = "Salasana";

/* Person’s name field placeholder */
"John Appleseed" = "John Appleseed";

/* Person’s name field title */
"Name" = "Nimi";

/* Pinboard login option */
"Use API Token" = "Käytä API Tokenia";

/* Pinboard login option */
"Use API Token Instead" = "Käytä sen sijaan API Tokenia";

/* Pinboard login option */
"Use Password" = "Käytä salasanaa";

/* Pinboard login option */
"Use Password Instead" = "Käytä salasanaa";

/* Pinboard login section header */
"API Token" = "API Token";

/* Pinboard login section header */
"Pinboard Login" = "Pinboard-sisäänkirjautuminen";

/* Playlist picker parameter */
"My Music Library" = "Oma musiikkikirjasto";

/* Pocket (app) get action error */
"No items matching the specified criteria were found in Pocket." = "Pocketista ei löytynyt yhtään määritettyjä kriteerejä vastaavaa kohdetta.";

/* Post to Tumblr action error */
"No Blog" = "Ei blogia";

/* Post to Tumblr action error description */
"You did not specify which blog to post to." = "Et määrittänyt, mihin blogiin julkaistaan.";

/* QuickLook action error */
"No Items" = "Ei kohteita";

/* QuickLook action error */
"The Quick Look action wasn't passed any items to preview." = "Quick Look -toimintoon ei annettu esikatseltavia kohteita.";

/* Recovery option; Enable Siri */
"Enable Siri" = "Ota Siri käyttöön";

/* Remove calendar item error */
"Remove" = "Poista";

/* Request payment error message when the amount is below the minimum amount allowed */
"The amount you specified, %@, is above the maximum amount you are allowed to request." = "Määrittämäsi summa, %@, on yli enimmäissumman, jonka saat pyytää.";

/* Request payment error message when the amount is below the minimum amount allowed */
"The amount you specified, %@, is below the minimum amount you are allowed to request." = "Määrittämäsi summa, %@, on alle vähimmäissumman, jonka saat pyytää.";

/* Request payment error message when the user has no account for the payment service. %@ = service name, i.e. Apple Pay */
"The person you are trying to request money from doesn't have a account set up with %@." = "Henkilö, jolta yrität pyytää rahaa, ei ole ottanut käyttöön tiliä palvelulle %@.";

/* Required field placeholder */
"Required" = "Vaaditaan";

/* Run JavaScript action error message */
"The script must call the function `completion(result)` when finished" = "Skriptin on kutsuttava funktio `completion(result)` kun se on valmis";

/* Run JavaScript on Web Page action error description when code failed while running and we don't know why */
"An unknown error occurred when running JavaScript." = "JavaScriptiä suoritettaessa tapahtui tuntematon virhe.";

/* Run JavaScript on Web Page action error description when the script doesn't call completion() before Safari's timeout */
"Run JavaScript on Web Page failed because the script took too long to call the completion handler." = "Suorita JavaScript verkkosivulla -toiminto epäonnistui, koska skriptin loppukäsittelijän kutsu kesti liian kauan.";

/* Run JavaScript on Web Page action error title when JavaScript takes too long before returning */
"JavaScript Timeout" = "JavaScript aikakatkaistiin";

/* Run JavaScript on Web Page action error title when code failed while running */
"JavaScript Exception" = "JavaScript-poikkeus";

/* Run JavaScript on Web Page action error title when code is invalid */
"Invalid JavaScript" = "Virheellinen JavaScript";

/* Run SSH script action; SSH authentication error */
"SSH Authentication Failed" = "SSH-todentaminen epäonnistui";

/* Run SSH script action; SSH authentication error description */
"Please check your credentials in the Run SSH Script action and try again." = "Tarkista tunnistetietosi Suorita SSH-skripti -toiminnossa ja yritä uudelleen.";

/* Run shortcut action; shortcut to run not found error */
"Shortcut Not Found" = "Oikotietä ei löytynyt";

/* Run shortcut action; shortcut to run not found error description */
"Make sure a valid shortcut is selected in the Run Shortcut action." = "Varmista, että Suorita oikotie -toiminnossa on valittu kelvollinen oikotie.";

/* SSH action error */
"Channel allocation error" = "Kanavanvarausvirhe";

/* SSH action error */
"Connection timed out" = "Yhteys aikakatkaistiin";

/* SSH action error */
"Run Script Over SSH could not connect to the SSH server." = "”Suorita skripti SSH:lla” ei saanut yhteyttä SSH-palvelimeen.";

/* Save to camera roll action; unknown album error */
"Unknown Album" = "Tuntematon albumi";

/* Save to camera roll action; unknown album error description */
"The photo album that was selected does not exist." = "Valittua kuva-albumia ei ole olemassa.";

/* Scan machine readable code action; scon view title */
"Scan Code" = "Skannaa koodi";

/* Search bar placeholder for searching for GIFs via Giphy */
"Search Giphy" = "Etsi Giphystä";

/* Search local businesses action; missing search query error */
"You must provide a search query to Search Local Businesses." = "Sinun on annettava hakukysely Etsi paikallisia yrityksiä -toimintoon.";

/* Search local businesses action; no locations found error */
"No Locations Found" = "Sijainteja ei löytynyt";

/* Search local businesses action; no locations found error description; %@=keyword */
"No locations were found with the keywords “%@”." = "Ei löydetty yhtään sijaintia avainsanoilla ”%@”.";

/* Section footer */
"If you use a self-hosted version of WordPress, enter the URL of your site above." = "Jos käytät WordPressiä omalla palvelimella, syötä sivustosi URL tähän.";

/* Section header */
"WordPress Login" = "WordPress-kirjautuminen";

/* Section header for WordPress site URL */
"Site URL" = "Sivuston URL";

/* Section header title */
"CloudApp Login" = "CloudApp-kirjautuminen";

/* Section header title */
"Incoming Mail Server" = "Saapuvan postin palvelin";

/* Section header title */
"Instapaper Login" = "Instapaper-kirjautuminen";

/* Section header title */
"Outgoing Mail Server" = "Lähtevän postin palvelin";

/* Section header title; email account */
"Accounts" = "Tilit";

/* Send email action error */
"Cannot send emails. Email may not be set up." = "Sähköposteja ei voida lähettää. Sähköpostia ei ehkä ole otettu käyttöön.";

/* Send email action; invalid email account error */
"Invalid Email Account" = "Virheellinen sähköpostitili";

/* Send email action; invalid email account error */
"The email account that is selected is not logged into Shortcuts on this device." = "Valittu sähköpostitili ei ole kirjautuneena Oikoteihin tässä laitteessa.";

/* Send message action error */
"Cannot send messages. iMessage may not be enabled." = "Viestejä ei voida lähettää. iMessage ei ehkä ole käytössä.";

/* Send payment error message when the amount is below the minimum amount allowed */
"The amount you specified, %@, is above the maximum amount you are allowed to send." = "Määrittämäsi summa, %@, on yli enimmäissumman, jonka saat lähettää.";

/* Send payment error message when the amount is below the minimum amount allowed */
"The amount you specified, %@, is below the minimum amount you are allowed to send." = "Määrittämäsi summa, %@, on alle vähimmäissumman, jonka saat lähettää.";

/* Send payment error message when the amount is in a currency that is not supported by the app (%1$@ = currency, i.e. US Dollars, %2$@ = service name, i.e. Apple Pay) */
"The amount you specified was in %1$@, which is not supported by %2$@." = "Määritit summan valuutassa (%1$@), jota %2$@ ei tue.";

/* Send payment error message when the user doesn't have enough money to send the payment. */
"Your account does not have enough money to send the payment." = "Tililläsi ei ole riittävästi rahaa maksun lähettämiseksi.";

/* Send payment error message when the user has no account for the payment service. %@ = service name, i.e. Apple Pay */
"The person you are trying to send money to doesn't have a account set up with %@." = "Henkilö, jolta yrität lähettää rahaa, ei ole ottanut käyttöön tiliä palvelulle %@.";

/* Send payment error message when the user has no bank account. */
"You don't have a bank account configured on this device." = "Et ole määrittänyt pankkitiliä tähän laitteeseen.";

/* Send payment error message when the user is logged out of the payment app and needs to verify their credentials. %@ = app name, i.e. Apple Pay */
"You will need to open %@ to verify your credentials." = "%@ on avattava, jotta voit vahvistaa tunnistetietosi.";

/* Send payment error title when the amount is above the maximum amount allowed */
"Above Maximum Amount" = "Yli enimmäissumman";

/* Send payment error title when the amount is below the minimum amount allowed */
"Below Minimum Amount" = "Alle vähimmäissumman";

/* Send payment error title when the amount is in a currency that is not supported by the app */
"Currency Unsupported" = "Valuuttaa ei tueta";

/* Send payment error title when the user doesn't have enough money to send the payment. */
"Insufficient Funds" = "Ei riittävästi rahaa";

/* Send payment error title when the user has no bank account. */
"No Bank Account" = "Ei pankkitiliä";

/* Send payment error title when the user is logged out of the payment app and needs to verify their credentials. */
"Credentials Unverified" = "Tunnistetietoja ei ole vahvistettu";

/* Send/request payment error title when the receiving user has no bank account. */
"No Account" = "Ei tiliä";

/* Service name */
"Box" = "Box";

/* Service name */
"CloudApp" = "CloudApp";

/* Service name */
"Location" = "Sijainti";

/* Service name */
"Microphone" = "Mikrofoni";

/* Service name */
"Notifications" = "Ilmoitukset";

/* Service name */
"Pinboard" = "Pinboard";

/* Service name */
"Speech Recognition" = "Puheentunnistus";

/* Service name */
"iCloud Drive" = "iCloud Drive";

/* Set dictionary value action; no key provided error description */
"No key was provided to the Set Dictionary Value action for the value “%@”." = "Arvolle %@ ei annettu avainta Aseta sanakirja-arvo -toiminnossa.";

/* Set dictionary value action; no value provided error */
"No Value Provided" = "Arvoa ei annettu";

/* Set dictionary value action; no value provided error description */
"No value was provided to the Set Dictionary Value action for the key “%@”." = "Avaimelle %@ ei annettu arvoa Aseta sanakirja-arvo -toiminnossa.";

/* Show definition action error */
"A definition could not be found for that term." = "Termille ei löytynyt määritelmää.";

/* Show definition action error */
"No Word Specified" = "Sanaa ei ole määritetty";

/* Show definition action error description */
"No word was passed as input to Show Definition" = "Yhtään sanaa ei annettu syötteenä Näytä määritelmä ‑toiminnolle";

/* Show definition action error description */
"This may happen if no dictionaries are installed. To manage your dictionaries, select a word in any app and choose “Look Up”. Then, tap “Manage”." = "Näin voi käydä, jos yhtään sanakirjaa ei ole asennettu. Jos haluat hallita sanakirjojasi, valitse sana missä tahansa apissa ja valitse Katso lisää. Napauta sitten Hallitse.";

/* Show in calendar action error */
"Calendar could not be opened." = "Kalenteria ei voitu avata.";

/* Show webpage action error */
"Unsupported URL" = "Osoitetta ei tueta";

/* Show webpage action error; %@=url scheme */
"Show Web Page supports http:// and https:// URLs, but you tried to show a %@:// URL." = "Näytä verkkosivu -toiminto tukee muotoja http:// ja https://, mutta yritit näyttää URLin, jonka muoto on %@:// URL.";

/* Speak text action; invalid language was provided by the user. */
"An invalid language was provided. Please provide a valid language." = "An invalid language was provided. Please provide a valid language.";

/* Speak text action; no language was provided by the user. */
"Please select a language to use when speaking." = "Please select a language to use when speaking.";

/* Start call error message when the calling service has not (yet) been configured, e. g. the user has not logged into the app. %@ = calling service name, e. g. FaceTime */
"%@ is not set up to make calls." = "%@ ei ole otettu käyttöön puheluja varten.";

/* Start call error message when the calling service is temporarily not available for any reason. %@ = calling service name, e. g. FaceTime */
"Starting call failed because %@ is not available." = "Puhelun aloitus epäonnistui, koska %@ ei ole käytettävissä.";

/* Start call error message when the contact is not supported by the calling service. %@ = contact identifier, e. g. phone number, email or handle. */
"Starting call failed because %@ cannot take part in the call." = "Puhelun aloitus epäonnistui, koska %@ ei voi osallistua puheluun.";

/* Start call error message when the contact's identifier (e. g. phone number, handle or email) is not valid on the calling service. %@ = calling service name, e. g. FaceTime */
"%@ does not support the contact details you provided." = "%@ ei tue antamiasi yhteystietoja.";

/* Start call error title when the calling service has not (yet) been configured, e. g. the user has not logged into the app. */
"Setup Required" = "Käyttöönotto vaaditaan";

/* Start call error title when the calling service is temporarily not available for any reason. %@ = calling service name, e. g. FaceTime */
"%@ Unavailable" = "%@ ei ole käytettävissä";

/* Start call error title when the contact is not supported by the calling service. */
"Contact Not Supported" = "Yhteystietoa ei tueta";

/* Start call error title when the contact's identifier (e. g. phone number, handle or email) is not valid on the calling service. */
"Invalid Contact Details" = "Virheelliset yhteystiedot";

/* Start date that blood pressure was recorded */
"Blood Pressure Start Date" = "Verenpaineen mittauksen aloituspävä";

/* Subcategory */
"Device" = "Laite";

/* Subcategory for Set Volume action */
"Playback" = "Toisto";

/* Take photo action error */
"No suitable camera was detected on this device." = "Tässä laitteessa ei havaittu sopivaa kameraa.";

/* Time until date action */
"An invalid date to compare to was provided." = "Annettiin virheellinen vertailupäivä.";

/* Time until date action */
"No from date was provided." = "Alkamispäivää ei annettu.";

/* Time until date action error */
"An invalid from date was provided." = "Annettiin virheellinen alkamispäivä.";

/* Title of default error for not allowing script to run */
"Unsafe JavaScript" = "Epäluotettava JavaScript";

/* Toggle do not disturb; error */
"An invalid end time was provided. Please provide an end time for Do Not Disturb." = "Annettiin virheellinen päättymisaika. Anna päättymisaika Älä häiritse ‑toiminnolle.";

/* Toggle do not disturb; error */
"No calendar event was provided. Please provide a calendar event to enable Do Not Disturb for the duration of." = "Kalenteritapahtumaa ei annettu. Anna kalenteritapahtuma, jotta Älä häiritse ‑toiminto voidaan ottaa käyttöön tapahtuman ajaksi.";

/* Toggle do not disturb; error */
"Please provide an end time that is later than the current time for Do Not Disturb." = "Anna päättymisaika, joka on myöhemmin kuin nykyinen aika Älä häiritse ‑toiminnolle.";

/* Trim video action error */
"The input was not a video that can be edited." = "Syöte ei ollut video, jota voidaan muokata.";

/* URL action error; %@=url */
"Invalid URL: %@" = "Virheellinen URL: %@";

/* Ulysses (app) error description */
"Please re-authorize Shortcuts with Ulysses to access this sheet." = "Valtuuta Oikotiet uudelleen Ulyssesin kanssa, jos haluat käyttää tätä arkkia.";

/* Ulysses (app) error failure reason */
"Ulysses Access Required" = "Ulysses-käyttöoikeus vaaditaan";

/* Unspecified health kit category sample type */
"Unspecified" = "Määrittämätön";

/* Used as a file name prefix before a date/time string, for example: Audio Recording 2018-03-01 at 8.13.46 PM */
"Audio Recording" = "Äänitallennus";

/* Used in a list to delimit the elements < (n - 1) (e.g. Green, Purple, Red, Orange, and Blue). Be sure to include a space if your language requires it. */
", " = ", ";

/* Used in a list to delimit the elements = (n - 1) (e.g. Green, Purple, Red, Orange, and Blue). Be sure to include a space if your language requires it. */
", and " = " ja ";

/* Used to delimit a list of exactly two items (e.g. Green and Blue). */
" and " = " ja ";

/* User name field title */
"User Name" = "Käyttäjätunnus";

/* Username placeholder or title */
"Username" = "Käyttäjätunnus";

/* User’s device flashlight is not currently available error */
"This device’s flashlight is not currently available for Shortcuts to use." = "Laitteen taskulamppu ei tällä hetkellä ole Oikoteiden käytettävissä.";

/* User’s device has no flashlight error */
"This device does not have a flashlight." = "Tässä laitteessa ei ole taskulamppua.";

/* Weather action; no custom location provided error description */
"The weather action was configured to get the weather at a custom location, but none was provided." = "Säätoiminto määritettiin antamaan muokatun sijainnin sää, mutta sellaista ei annettu.";

/* Weather action; no location was found to search weather */
"Unable to determine location." = "Sijaintia ei voida määrittää.";

/* Weather condition: Blizzard */
"Blizzard" = "Lumimyrskyä";

/* Weather condition: Blowing Snow */
"Blowing Snow" = "Lumituiskua";

/* Weather condition: Blustery */
"Blustery" = "Myrskyä";

/* Weather condition: Clear */
"Clear" = "Selkeää";

/* Weather condition: Cloudy */
"Cloudy" = "Pilvistä";

/* Weather condition: Cold */
"Cold" = "Kylmää";

/* Weather condition: Drizzle */
"Drizzle" = "Tihkusadetta";

/* Weather condition: Dust */
"Dust" = "Pölyä";

/* Weather condition: Foggy */
"Foggy" = "Sumuista";

/* Weather condition: Freezing Drizzle */
"Freezing Drizzle" = "Jäätävää tihkusadetta";

/* Weather condition: Freezing Rain */
"Freezing Rain" = "Jäätävää sadetta";

/* Weather condition: Hail */
"Hail" = "Raekuuroja";

/* Weather condition: Haze */
"Haze" = "Usvaa";

/* Weather condition: Heavy Rain */
"Heavy Rain" = "Rankkaa sadetta";

/* Weather condition: Heavy Snow */
"Heavy Snow" = "Sakeaa lumisadetta";

/* Weather condition: Hot */
"Hot" = "Kuumaa";

/* Weather condition: Hurricane */
"Hurricane" = "Hurrikaani";

/* Weather condition: Isolated Thundershowers */
"Isolated Thundershowers" = "Yksittäisiä ukkoskuuroja";

/* Weather condition: Isolated Thunderstorms */
"Isolated Thunderstorms" = "Yksittäisiä ukkosmyrskyjä";

/* Weather condition: Light Snow Showers */
"Light Snow Showers" = "Hajanaisia lumikuuroja";

/* Weather condition: Mixed Rain And Hail */
"Mixed Rain And Hail" = "Vesi- ja raekuuroja";

/* Weather condition: Mixed Rain And Sleet */
"Mixed Rain And Sleet" = "Vesi- ja räntäsadetta";

/* Weather condition: Mixed Rain And Snow */
"Mixed Rain And Snow" = "Vesi- ja lumisadetta";

/* Weather condition: Mixed Snow And Sleet */
"Mixed Snow And Sleet" = "Lumi- ja räntäsadetta";

/* Weather condition: Mostly Clear */
"Mostly Clear" = "Enimmäkseen selkeää";

/* Weather condition: Mostly Cloudy */
"Mostly Cloudy" = "Enimmäkseen pilvistä";

/* Weather condition: Partly Cloudy */
"Partly Cloudy" = "Puolipilvistä";

/* Weather condition: Rain */
"Rain" = "Sadetta";

/* Weather condition: Scattered Showers */
"Scattered Showers" = "Hajanaisia sadekuuroja";

/* Weather condition: Scattered Snow Showers */
"Scattered Snow Showers" = "Hajanaisia lumikuuroja";

/* Weather condition: Scattered Thunderstorms */
"Scattered Thunderstorms" = "Hajanaisia ukkosmyrskyjä";

/* Weather condition: Severe Thunderstorms */
"Severe Thunderstorms" = "Kovaa ukkosmyrskyä";

/* Weather condition: Showers */
"Showers" = "Sadekuuroja";

/* Weather condition: Sleet */
"Sleet" = "Räntää";

/* Weather condition: Smoky */
"Smoky" = "Savuista";

/* Weather condition: Snow */
"Snow" = "Lunta";

/* Weather condition: Snow Flurries */
"Snow Flurries" = "Heikkoa lumisadetta";

/* Weather condition: Thunderstorms */
"Thunderstorms" = "Ukkosmyrskyä";

/* Weather condition: Tornado */
"Tornado" = "Tornado";

/* Weather condition: Tropical Storm */
"Tropical Storm" = "Trooppista myrskyä";

/* Weather condition: Windy */
"Windy" = "Tuulista";

/* Weather: %1$@ = temperature, %2$@ = condition (i.e. sunny) */
"%1$@ and %2$@" = "%2$@ ja %1$@";

/* Weather: Pollutant in the air */
"Air Pollutant (Single)" = "Ilmansaaste";

/* Weather: Pollutants in the air */
"Air Pollutant (Plural)" = "Ilmansaasteet";

/* Wordpress url placeholder */
"https://wordpress.com" = "https://wordpress.com";

/* iCloud Drive error */
"The folder doesn’t exist." = "Kansiota ei ole olemassa.";

/* iCloud Drive error */
"The iCloud Container could not be found." = "iCloud-säiliötä ei löytynyt.";

/* iCloud Drive error */
"iCloud could not get a link to this file because it is a folder. iCloud only supports getting links to regular files." = "iCloud ei saanut linkkiä tähän tiedostoon, koska se on kansio. iCloud tukee vain linkkejä normaaleihin tiedostoihin.";

/* iCloud Drive error; %@ = type description */
"iCloud could not get a link to this %@ because it is a bundle (a bundle is a folder that acts like a file)." = "iCloud ei saanut linkkiä tähän (%@), koska se on nippu (nippu on kansio, joka käyttäytyy kuin tiedosto).";

/* iCloud Drive error; %@=file URL */
"“%@” is a bundle" = "%@ on paketti";

/* iCloud Drive error; %@=file path */
"The path you tried to save to (%@) does not exist in iCloud." = "Polkua, johon yritit tallentaa (%@), ei ole iCloudissa.";

/* iCloud Drive error; %@=file path */
"The path you tried to save to (%@) is an existing file in iCloud. When saving multiple files at a time, you should specify a path to a folder instead." = "Polku, johon yritit tallentaa (%@), on olemassa oleva tiedosto iCloudissa. Kun tallennat useita tiedostoja kerralla, on sen sijaan määritettävä polku kansioon.";

/* iCloud Drive or Dropbox error; %@=file URL or name */
"“%@” is a folder" = "%@ on kansio";

/* iCloud Drive, Dropbox, Box error */
"File already exists" = "Tiedosto on jo olemassa";

/* iCloud Drive, Dropbox, Box error */
"File already exists." = "Tiedosto on jo olemassa.";

/* iCloud email login authentication error description */
"The email address or password you specified was incorrect. To log into iCloud Mail in Shortcuts, you must use an app-specific password.\n\nIf you don’t have Two-Factor Authentication enabled, you must enable it in order to generate an app-specific password." = "Määrittämäsi sähköpostiosoite tai salasana oli virheellinen. Jos haluat kirjautua iCloud Mailiin Oikoteissä, sinun on käytettävä appikohtaista salasanaa.\n\nJos sinulla ei ole kaksiosainen todennus käytössä, sinun on otettava se käyttöön appikohtaisen salasanan luomista varten.";

/* iTunes Attribute Type for Actor, used for specifying where to search */
"Actor (Attribute)" = "Näyttelijä";

/* iTunes Attribute Type for Album, used for specifying where to search */
"Album (Attribute)" = "Albumi";

/* iTunes Attribute Type for Artist, used for specifying where to search */
"Artist (Attribute)" = "Artisti";

/* iTunes Attribute Type for Author, used for specifying where to search */
"Author (Attribute)" = "Tekijä";

/* iTunes Attribute Type for Composer, used for specifying where to search */
"Composer (Attribute)" = "Säveltäjä";

/* iTunes Attribute Type for Description, used for specifying where to search */
"Description (Attribute)" = "Kuvaus";

/* iTunes Attribute Type for Director, used for specifying where to search */
"Director (Attribute)" = "Ohjaaja";

/* iTunes Attribute Type for Feature Film, used for specifying where to search */
"Feature Film (Attribute)" = "Esittelyssä olevat";

/* iTunes Attribute Type for Genre, used for specifying where to search */
"Genre (Attribute)" = "Genre";

/* iTunes Attribute Type for Keywords, used for specifying where to search */
"Keywords (Attribute)" = "Avainsanat";

/* iTunes Attribute Type for Language, used for specifying where to search */
"Language (Attribute)" = "Kieli";

/* iTunes Attribute Type for Movie Artist, used for specifying where to search */
"Movie Artist (Attribute)" = "Artisti";

/* iTunes Attribute Type for Movie, used for specifying where to search */
"Movie (Attribute)" = "Elokuva";

/* iTunes Attribute Type for Producer, used for specifying where to search */
"Producer (Attribute)" = "Tuottaja";

/* iTunes Attribute Type for Product ID, used for specifying where to search */
"Product ID (Attribute)" = "Tuotteen tunnus";

/* iTunes Attribute Type for Rating Index, used for specifying where to search */
"Rating Index (Attribute)" = "Arviointi-indeksi";

/* iTunes Attribute Type for Rating, used for specifying where to search */
"Rating (Attribute)" = "Arviointi";

/* iTunes Attribute Type for Release Year, used for specifying where to search */
"Release Year (Attribute)" = "Julkaisuvuosi";

/* iTunes Attribute Type for Short Film, used for specifying where to search */
"Short Film (Attribute)" = "Lyhytelokuva";

/* iTunes Attribute Type for Show, used for specifying where to search */
"Show (Attribute)" = "Ohjelma";

/* iTunes Attribute Type for Software Developer, used for specifying where to search */
"Developer (Attribute)" = "Kehittäjä";

/* iTunes Attribute Type for Song, used for specifying where to search */
"Song (Attribute)" = "Kappale";

/* iTunes Attribute Type for TV Episode, used for specifying where to search */
"Episode (Attribute)" = "Jakso";

/* iTunes Attribute Type for TV Season, used for specifying where to search */
"Season (Attribute)" = "Kausi";

/* iTunes Attribute Type for Title, used for specifying where to search */
"Title (Attribute)" = "Nimi";

/* iTunes Attribute Type for all (every field), used for specifying where to search */
"All (Attribute)" = "Kaikki";

/* iTunes Attribute Type for all (generic) artists, used for specifying where to search */
"All Artist (Attribute)" = "Artisti";

/* iTunes Attribute Type for all (generic) tracks, used for specifying where to search */
"Track (Attribute)" = "Raita";

/* iTunes Entity Type for Audiobook Author, used for specifying the results of a search */
"Audiobook Authors (Entity Type)" = "Tekijät";

/* iTunes Entity Type for Audiobook, used for specifying the results of a search */
"Audiobooks (Entity Type)" = "Äänikirjat";

/* iTunes Entity Type for Books, used for specifying the results of a search */
"Books (Entity Type)" = "Kirjat";

/* iTunes Entity Type for Mac Software, used for specifying the results of a search */
"Mac (Entity Type)" = "Mac";

/* iTunes Entity Type for Movie Artists, used for specifying the results of a search */
"Movie Artists (Entity Type)" = "Artistit";

/* iTunes Entity Type for Movie, used for specifying the results of a search */
"Movies (Entity Type)" = "Elokuvat";

/* iTunes Entity Type for Music Album, used for specifying the results of a search */
"Albums (Entity Type)" = "Albumit";

/* iTunes Entity Type for Music Artist, used for specifying the results of a search */
"Music Artists (Entity Type)" = "Artistit";

/* iTunes Entity Type for Music Song, used for specifying the results of a search */
"Songs (Entity Type)" = "Kappaleet";

/* iTunes Entity Type for Music Track, used for specifying the results of a search */
"Music Tracks (Entity Type)" = "Raidat";

/* iTunes Entity Type for Music Video, used for specifying the results of a search */
"Music Videos (Entity Type)" = "Musiikkivideot";

/* iTunes Entity Type for Podcast Author, used for specifying the results of a search */
"Podcast Authors (Entity Type)" = "Tekijät";

/* iTunes Entity Type for Podcast, used for specifying the results of a search */
"Podcasts (Entity Type)" = "Podcastit";

/* iTunes Entity Type for Short Film Artist, used for specifying the results of a search */
"Short Film Artists (Entity Type)" = "Artistit";

/* iTunes Entity Type for Short Film, used for specifying the results of a search */
"Short Films (Entity Type)" = "Lyhytelokuvat";

/* iTunes Entity Type for TV Episodes, used for specifying the results of a search */
"Episodes (Entity Type)" = "Jaksot";

/* iTunes Entity Type for TV Season, used for specifying the results of a search */
"Seasons (Entity Type)" = "Kaudet";

/* iTunes Entity Type for generic artists, used for specifying the results of a search */
"Artists (Entity Type)" = "Artistit";

/* iTunes Entity Type for generic tracks, used for specifying the results of a search */
"Tracks (Entity Type)" = "Raidat";

/* iTunes Entity Type for iPad Software, used for specifying the results of a search */
"iPad (Entity Type)" = "iPad";

/* iTunes Entity Type for iPhone Software, used for specifying the results of a search */
"iPhone (Entity Type)" = "iPhone";

/* iTunes Media Type for Apps, used for searching */
"Apps (Media Type)" = "Apit";

/* iTunes Media Type for Audiobooks, used for searching */
"Audiobooks (Media Type)" = "Äänikirjat";

/* iTunes Media Type for Books, used for searching */
"Books (Media Type)" = "Kirjat";

/* iTunes Media Type for Music Videos, used for searching */
"Music Videos (Media Type)" = "Musiikkivideot";

/* iTunes Media Type for Music, used for searching */
"Music (Media Type)" = "Musiikki";

/* iTunes Media Type for Podcasts, used for searching */
"Podcasts (Media Type)" = "Podcastit";

/* iTunes Media Type for Short Films, used for searching */
"Short Films (Media Type)" = "Lyhytelokuvat";

/* iTunes Media Type for TV Shows, used for searching */
"TV Shows (Media Type)" = "TV-ohjelmat";

/* iTunes Media Type for everything (no filter on the type), used for searching */
"All (Media Type)" = "Kaikki";

/* iTunes Media Type of Movie, used for searching */
"Movies (Media Type)" = "Elokuvat";

